# Groupby Method

Groupby allows you to group together rows based off of a column and perform an aggregate function on them

In [1]:
import pandas as pd 
import numpy as np
from numpy.random import randn

In [2]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [4]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [18]:
bycomp = df.groupby('Company') 
bycomp.mean()
# this will mean of all the values with respect to the companies
# NOTE: this operation will only run on data that are integers

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [15]:
# returns the sum of total earned by the company
bycomp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [16]:
bycomp.std()
# returns the standard deviation of the sales within the company

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [21]:
bycomp.sum().loc['GOOG']

Sales    320
Name: GOOG, dtype: int64

In [22]:
df.groupby("Company").sum().loc['GOOG']

Sales    320
Name: GOOG, dtype: int64

In [27]:
df.groupby("Sales").max()

      Company   Person
Sales
120      GOOG  Charlie
124      MSFT  Vanessa
200      GOOG      Sam
243        FB     Carl
340      MSFT      Amy
350        FB    Sarah

In [28]:
df.groupby("Company").min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [32]:
df.groupby("Company").describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64